
## Terraform Plan of GCP
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
google_cloud_run_service.attendance_request_bot: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/attendance-request-bot]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_scheduler_job.attendance_request_bot will be created
  + resource "google_cloud_scheduler_job" "attendance_request_bot" {
      + attempt_deadline = "600s"
      + description      = "Sends a message to the attendance-request-bot channel"
      + id               = (known after apply)
      + name             = "attendance-request-bot"
      + paused           = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "9 45 * * 1"
      + state            = (known after apply)
      + time_zone        = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = "https://attendance-request-bot-ibzykqu2gq-an.a.run.app"
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @igsr5, Action: `pull_request`*